In [37]:
# Load library
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns


df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [38]:
#1. Fill in the missing numbers in the FlightNumber column (meant to increase by ten with each row) and make the column an integer column.

df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [39]:
#2. Split the From_To column with '_' as the delimiter on a new temporary DataFrame. Assign the correct column names to this temporary DataFrame.

tdf = pd.DataFrame(df.From_To)
tdf[['From', 'To']] = tdf.From_To.str.split('_', expand = True)
tdf

            From_To      From         To
0      LoNDon_paris    LoNDon      paris
1      MAdrid_miLAN    MAdrid      miLAN
2  londON_StockhOlm    londON  StockhOlm
3    Budapest_PaRis  Budapest      PaRis
4   Brussels_londOn  Brussels     londOn

In [40]:
#3. Standardise the strings in the temporary DataFrame, so that only the first letter is uppercase.

tdf['From'] = tdf.From.str.title()
tdf['To'] = tdf.To.str.title()
tdf

            From_To      From         To
0      LoNDon_paris    London      Paris
1      MAdrid_miLAN    Madrid      Milan
2  londON_StockhOlm    London  Stockholm
3    Budapest_PaRis  Budapest      Paris
4   Brussels_londOn  Brussels     London

In [41]:
#4. Delete the From_To column from df, and attach the temporary DataFrame from the previous questions.

df = df.drop('From_To', 1)
tdf = tdf.drop('From_To', 1)
df = pd.concat([df,tdf], axis = 1)
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

In [42]:
#6. Expand the series of delays into a DataFrame named "delays". Each delay value should be in its own column. Missing values should be NaN. Rename the columns: delay_1, delay_2, etc. Replace RecentDelays with this DataFrame. 

tDelay = pd.DataFrame(df.RecentDelays)
tDelay = pd.DataFrame(df['RecentDelays'].values.tolist())
tDelay.columns = ['Delay_1', 'Delay_2', 'Delay_3']
df = df.drop('RecentDelays', 1)
df.insert(3, "Delay_1", tDelay['Delay_1'])
df.insert(4, "Delay_2", tDelay['Delay_2'])
df.insert(5, "Delay_3", tDelay['Delay_3'])
print(df)

               Airline  FlightNumber      From  Delay_1  Delay_2  Delay_3  \
0               KLM(!)         10045    London     23.0     47.0      NaN
1    <Air France> (12)         10055    Madrid      NaN      NaN      NaN
2  (British Airways. )         10065    London     24.0     43.0     87.0
3       12. Air France         10075  Budapest     13.0      NaN      NaN
4          "Swiss Air"         10085  Brussels     67.0     32.0      NaN

          To
0      Paris
1      Milan
2  Stockholm
3      Paris
4     London